Revit 2027 API
ParameterTypeId.RbsPipeDiameterParam Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsPipeDiameterParam { get; }
Public Shared ReadOnly Property RbsPipeDiameterParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsPipeDiameterParam {
	ForgeTypeId^ get ();
}
static member RbsPipeDiameterParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace